app/controllers/restaurantes_controller.rb

	def index
#		@restaurantes = Restaurante.find(:all, :order => "nome")
		@restaurantes = Restaurante.paginate :page => params['page'], :per_page => 3
---
SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`

	def show
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)

	def create
		@restaurante = Restaurante.new(params[:restaurante])
		if @restaurante.save
---
INSERT INTO `restaurantes` (`endereco`, `created_at`, `nome`, `updated_at`, `especialidade`) VALUES('testes', '2010-08-17 00:35:34', 'Teste', '2010-08-17 00:35:34', 'testes')

	def edit
		@restaurante = Restaurante.find(params[:id])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)

	def update
		@restaurante = Restaurante.find(params[:id])
		if @restaurante.update_attributes(params[:restaurante])
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
UPDATE `restaurantes` SET `updated_at` = '2010-08-17 00:38:10', `endereco` = 'bla' WHERE `id` = 7

	def destroy
		@restaurante = Restaurante.find(params[:id])
		@restaurante.destroy
---
SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
DELETE FROM `restaurantes` WHERE `id` = 7